---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.Hub
source: html/f155806a-1e68-b604-38d2-719ca81bff2e.htm
---
# Hub Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.